#+title: Examples


#+begin_src java :results output :exports both
class FactDemo {
    public static int fact(int n) {
        if (n==1) {
            return 1;
        } else {
            return n * fact(n-1);
        }
    }

    public static void main(String[] args) {
        System.out.println(fact(4));
    }
}
#+end_src

#+RESULTS:
: 24


#+begin_src java :results output :exports both
import java.util.Arrays;
import java.util.List;
class ListAmusement {
    public static int sumList(List<Integer> nums) {
        if (nums.size() == 1) {
            return nums.get(0);
        } else {
            // first item plus sum of the rest
            return
                nums.get(0) +
                sumList(nums.subList(1,nums.size()));
        }
    }

    public static void main(String[] args) {
        List<Integer> list = Arrays.asList(9, 2, 3, 7);
        System.out.println(sumList(list));
    }
}
#+end_src

#+RESULTS:
: 21


#+begin_src java :results output :exports both
public class SortingFun {
    public static boolean checkSorted(List<Integer> nums) {
        if (nums.size() == 1) {
            return true;
        } else if (nums.size() == 2) {
            return (nums.get(0) <= nums.get(1));
        } else {
            return
                (nums.get(0) <= nums.get(1)) &&
                 checkSorted(nums.subList(1, nums.size())));
        }
}

#+end_src
